### <a name='0'></a>Import libraries

In [1]:
import numpy as np
import pandas as pd

pd.__version__

'1.1.5'

### <a name='1'></a> Exercise 101
From the list given below:


```
stocks = ['PLW', 'CDR', '11B', 'TEN']
```
Create object type series.

__Excepted result:__


```
0    PLW
1    CDR
2    11B
3    TEN
dtype: object
```

In [2]:
stocks = ['PLW', 'CDR', '11B', 'TEN']
# Solution
pd.Series(stocks)

0    PLW
1    CDR
2    11B
3    TEN
dtype: object

### <a name='2'></a> Exercise 102
From the dictionary given below:


```
stocks = {'PLW': 387.00, 'CDR': 339.5, 'TEN': 349.5, '11B': 391.0}
```
Create object Series and assign it into variable _quotations_.

__Excepted result:__


```
PLW    387.0
CDR    339.5
TEN    349.5
11B    391.0
dtype: float64
```

In [3]:
stocks = {'PLW': 387.00, 'CDR': 339.5, 'TEN': 349.5, '11B': 391.0}

# Solution
quotations= pd.Series(stocks)
quotations

PLW    387.0
CDR    339.5
TEN    349.5
11B    391.0
dtype: float64

### <a name='3'></a> Exercise 103
Transform variable _quotations_ to list.

__Excepted result:__


```
[387.0, 339.5, 349.5, 391.0]
```

In [4]:
# Solution
quotations.to_list()

[387.0, 339.5, 349.5, 391.0]

Transform the object _quotations_ to _numpy array_.

In [5]:
# Solution
quotations.values

array([387. , 339.5, 349.5, 391. ])

### <a name='4'></a> Exercise 104
Transform the object _quotations_ to format _DataFrame_. Set column name as _price_.

In [6]:
# Solution
pd.DataFrame(quotations,columns = ['price'])

     price
PLW  387.0
CDR  339.5
TEN  349.5
11B  391.0

### <a name='5'></a> Exercise 105
Using _numpy_ library create the object _Series_ showed below:


```
101    10.0
102    20.0
103    30.0
104    40.0
105    50.0
106    60.0
107    70.0
108    80.0
109    90.0
dtype: float64
```

In [7]:
# Solution
pd.Series(data = np.arange(10.0,100.0,10.0,dtype = 'float64'),
         index = np.arange(101,110,1,dtype = int))

101    10.0
102    20.0
103    30.0
104    40.0
105    50.0
106    60.0
107    70.0
108    80.0
109    90.0
dtype: float64

### <a name='6'></a> Exercise 106
The object type _Series_ is given below:

```
series = pd.Series(['001', '002', '003', '004'], list('abcd'))
```
Convert values in object from _series_ to _int 64_.

In [8]:
series = pd.Series(['001', '002', '003', '004'], list('abcd'))

# Solution
series.astype('int64')

a    1
b    2
c    3
d    4
dtype: int64

Convert data type of values in  _series_ to _float_.

In [9]:
# Solution
series.astype('float64')

a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64

### <a name='7'></a> Exercise 107
From the object _quotations_ given below:

```
stocks = {'PLW': 387.00, 'CDR': 339.5, 'TEN': 349.5, '11B': 391.0}
quotations = pd.Series(data=stocks)
```
Add two elements:
* index: BBT, value: 25.5
* index: F51, value: 19.2

__Excepted result:__


```
PLW    387.0
CDR    339.5
TEN    349.5
11B    391.0
BBT     25.5
F51     19.2
dtype: float64
```

In [10]:
stocks = {'PLW': 387.00, 'CDR': 339.5, 'TEN': 349.5, '11B': 391.0}
quotations = pd.Series(data=stocks)

# Solution
quotations['BBT'] = 25.5
quotations['F51'] = 19.2
quotations

PLW    387.0
CDR    339.5
TEN    349.5
11B    391.0
BBT     25.5
F51     19.2
dtype: float64

### <a name='8'></a> Exercise 108
Obiekt _quotations_ z poprzedniego ćwiczenia przekształć do obiektu typu _DataFrame_. Zresetuj indeks i nadaj nazwy kolumn '_ticker_' oraz _'price'_.

In [11]:
# Solution
DF = pd.DataFrame(data = quotations).reset_index()
DF.columns = ['ticker','price']
DF

  ticker  price
0    PLW  387.0
1    CDR  339.5
2    TEN  349.5
3    11B  391.0
4    BBT   25.5
5    F51   19.2

### <a name='9'></a> Exercise 109
Create the object _DataFrame_ with values showed below then assign to variable _companies_:

|    | company   |   price | ticker   |
|---:|:----------|--------:|:---------|
|  0 | Amazon    |  2375   | AMZN.US  |
|  1 | Microsoft |   178.6 | MSFT.US  |
|  2 | Facebook  |   179.2 | FB.US    |

In [12]:
# Solution
companies = pd.DataFrame(data = {'company':['Amazon','Microsoft','Facebook'],
                     'price':[2375,178.6,179.2],
                     'ticker':['AMZN.US','MSFT.US','FB.US']})
companies

     company   price   ticker
0     Amazon  2375.0  AMZN.US
1  Microsoft   178.6  MSFT.US
2   Facebook   179.2    FB.US

### <a name='10'></a> Exercise 110
Transform the first column in _companies_ to index.

In [13]:
# Solution
companies = companies.set_index('company')
companies

            price   ticker
company
Amazon     2375.0  AMZN.US
Microsoft   178.6  MSFT.US
Facebook    179.2    FB.US

Cut index _Facebook_ from the object _companies_.

In [14]:
# Solution
companies[companies.index == 'Facebook']

          price ticker
company
Facebook  179.2  FB.US

Return the stock price of _Microsoft_

In [15]:
# Solution
print(f'The stock price of Microsoft company is {companies.loc["Microsoft","price"]}')

The stock price of Microsoft company is 178.6